/*************************************************************************
	> File Name: 1_Multiples_3or5.c
	> Author: 
	> Mail: 
	> Created Time: Wed 05 Jul 2023 07:28:13 PM CST
 ************************************************************************/

#include<stdio.h>
/**
 *创建累加求和变量sum
 *从1开始遍历，判断遍历到的数是否是3或5的倍数
 */
 
/*
 * int main(){
    int sum = 0;
   .//时间复杂度o(n),空间复杂度o(1) 
    for(int i = 0; i < 1000; i++){
        if(i % 3 == 0 || i % 5 == 0){
            sum += i;
        }
    }
    printf("%d\n", sum);
    return 0;
}*
*/

/**
 * 优化：时间复杂度o(1)（数列）
 */

 int main(){
     //1000不算
     //利用/的特性：下取整
    int sum3 = (3 + 999) * (1000 / 3) /2, sum5 = (5 + 995) * (999 / 5) / 2, sum15 = (15 + 999 / 15 * 15) * (1000 / 15) / 2;
    printf("%d\n", sum3+sum5-sum15);
    return 0;
 }
